app/views/tropes/show.html.erb

SELECT "panes".* FROM "panes" WHERE "panes"."trope_id" = $1  [["trope_id", 3]]
---
  </li>
  <% @trope.panes.each do |pane| %>

SELECT "items".* FROM "items" WHERE "items"."pane_id" = $1  [["pane_id", 1]]
---
        </li>
        <% pane.items.each do |item| %>