app/controllers/items_controller.rb

  def index
    @pane = Pane.find(params[:pane_id])
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 2]]

  def new
    @pane = Pane.find(params[:pane_id])
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @pane = Pane.find(params[:pane_id])
    @item = Item.create!(item_params.merge(pane: @pane))
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "items" ("title", "url", "photo_url", "pane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "zakk"], ["url", ""], ["photo_url", ""], ["pane_id", 1], ["created_at", "2015-08-04 22:27:52.013386"], ["updated_at", "2015-08-04 22:27:52.013386"]]

  def show
    @pane = Pane.find(params[:pane_id])
    @item = Item.find(params[:id])
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @pane = Pane.find(params[:pane_id])
    @item = Item.find(params[:id])
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 5]]

  def update
    @pane = Pane.find(params[:pane_id])
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "items" SET "title" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["title", "Top of the rocks"], ["updated_at", "2015-08-05 14:21:13.198689"], ["id", 1]]

  def destroy
    @pane = Pane.find(params[:pane_id])
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]