app/controllers/panes_controller.rb

SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @trope = Trope.find(params[:trope_id])

SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]
---
  def new
    @trope = Trope.find(params[:trope_id])

SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "panes" ("title", "trope_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "walrus"], ["trope_id", 3], ["created_at", "2015-08-04 15:17:36.441074"], ["updated_at", "2015-08-04 15:17:36.441074"]]
---
  def create
    @trope = Trope.find(params[:trope_id])
    @pane = Pane.create!(pane_params.merge(trope: @trope))

SELECT "items".* FROM "items" WHERE "items"."pane_id" = $1  [["pane_id", 2]]
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @item = Item.find(params[:id])
    @pane = Pane.find(@item)

SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @trope = Trope.find(params[:trope_id])
    @pane = Pane.find(params[:id])

SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "panes" SET "title" = $1, "updated_at" = $2 WHERE "panes"."id" = $3  [["title", "Raininess"], ["updated_at", "2015-08-04 21:43:50.206316"], ["id", 1]]
---
  def update
    @trope = Trope.find(params[:trope_id])
    @pane = Pane.find(params[:id])
    @pane.update(pane_params)

SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "panes".* FROM "panes" WHERE "panes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "panes" WHERE "panes"."id" = $1  [["id", 1]]
---
  def destroy
    @trope = Trope.find(params[:trope_id])
    @pane = Pane.find(params[:id])
    @pane.destroy