app/controllers/panes_controller.rb

  def show
    @trope = Trope.find(params[:trope_id])
---
SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 1]]