app/controllers/tropes_controller.rb

  def index
    @tropes = User.find(session[:user]["id"]).tropes
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tropes".* FROM "tropes" WHERE "tropes"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.find(session[:user]["id"])
    @trope = @user.tropes.create!(trope_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "tropes" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "main 3"], ["user_id", 1], ["created_at", "2015-08-04 14:35:17.761715"], ["updated_at", "2015-08-04 14:35:17.761715"]]

  def show
    @trope = Trope.find(params[:id])
---
SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]

  def edit
    @trope = Trope.find(params[:id])
---
SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]

  def update
    @trope = Trope.find(params[:id])
    @trope.update(trope_params)
---
SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "tropes" SET "title" = $1, "updated_at" = $2 WHERE "tropes"."id" = $3  [["title", "a 3"], ["updated_at", "2015-08-04 15:24:06.052629"], ["id", 3]]

  def destroy
    @trope = Trope.find(params[:id])
    @trope.destroy
---
SELECT  "tropes".* FROM "tropes" WHERE "tropes"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "tropes" WHERE "tropes"."id" = $1  [["id", 3]]