app/controllers/users_controller.rb

  def sign_up!
    user = User.new(
      username: params[:username],
      password_digest: BCrypt::Password.create(params[:password])
    )
---
INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "peter"], ["password_digest", "$2a$10$YU4trwmNNxTDT1CB1C2RS.Jgi3G7T.UnN9.N2hwIPlbb5nZdghkIa"]]

  def sign_in!
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "peter"]]