app/views/panes/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."pane_id" = $1  [["pane_id", 2]]
---
  </li>
  <% @pane.items.each do |item| %>